/*!
 * All the code that follow is
 * Copyright (c) 2015 - 2025 Richard Huang <rickypc@users.noreply.github.com>.
 * All Rights Reserved. Not for reuse without permission.
 */

export default {
  pali: {
    children: 'buddhā mahāmani ratana paṭimākara pūjemi । etena saccavajjena mahātēchō ceva mahāpañño । ca mahābhogo ca mahāyaśo ca bhavantu me । nibbānassa paccayo hotu',
    sinhala: {
      children: 'බුද්ධා මහාමණි රතන පටිමාකර පූජේමි . ඒතේන සචවජ්ජේන මහාතේඡෝ චේව මහාපඤ්ඤෝ . ච මහාභෝගෝ ච මහායශෝ ච භවන්තු මේ . නිබ්බානස්ස පචයෝ හෝතු',
      title: 'මහාමණිරතනපටිමාකර',
    },
    title: 'Mahāmaṇiratanapaṭimākara',
  },
  path: import.meta.url,
  sanskrit: {
    children: 'बुद्धा महामणि रतन पटिमाकर पूजेमि । एतेन सचवज्जेन महातेछो चेव महापञ्‍ञो । च महाभोगो च महायशो च भवन्तु मे । निब्बानस्स पचयो होतु',
    siddham: {
      children: '𑖤𑖲𑖟𑖿𑖠𑖯 𑖦𑖮𑖯𑖦𑖜𑖰 𑖨𑖝𑖡 𑖢𑖘𑖰𑖦𑖯𑖎𑖨 𑖢𑖳𑖕𑖸𑖦𑖰 𑗂 𑖊𑖝𑖸𑖡 𑖭𑖓𑖪𑖕𑖿𑖕𑖸𑖡 𑖦𑖮𑖯𑖝𑖸𑖔𑖺 𑖓𑖸𑖪 𑖦𑖮𑖯𑖢𑖗𑖿𑖗𑖺 𑗂 𑖓 𑖦𑖮𑖯𑖥𑖺𑖐𑖺 𑖓 𑖦𑖮𑖯𑖧𑖫𑖺 𑖓 𑖥𑖪𑖡𑖿𑖝𑖲 𑖦𑖸 𑗂 𑖡𑖰𑖤𑖿𑖤𑖯𑖡𑖭𑖿𑖭 𑖢𑖓𑖧𑖺 𑖮𑖺𑖝𑖲',
      title: '𑖦𑖮𑖯𑖦𑖜𑖰𑖨𑖝𑖡𑖢𑖘𑖰𑖦𑖯𑖎𑖨',
    },
    title: 'महामणिरतनपटिमाकर',
  },
  thai: {
    children: 'พุทฺธา มหามณิ รตน ปฏิมากร ปูเชมิ ฯ เอเตน สจวชฺเชน มหาเตโฉ เจว มหาปญฺโญ ฯ จ มหาโภโค จ มหายโศ จ ภวนฺตุ เม ฯ นิพฺพานสฺส ปจโย โหตุ',
    title: 'พระพุทธมหามณีรัตนปฏิมากร',
  },
  translation: {
    title: 'Great Emerald Buddha Primary',
  },
  transliteration: {
    children: 'buddhā mahāmani ratana paṭimākara pūjemi । etena saccavajjena mahātēchō ceva mahāpañño । ca mahābhogo ca mahāyaśo ca bhavantu me । nibbānassa paccayo hotu',
    speech: 'buddha mahamani ratana patimakara pu-j-mi, e-t-na sacca-wajjena maha-t-co c-wa mahapanyo, ca mahabogo ca mahayaso ca bhawantu mei. nibbanassa paccayo hotu',
    title: 'Mahāmaṇiratanapaṭimākara Hṛdaya',
  },
};
