/*!
 * Copyright © 2015 Richard Huang <rickypc@users.noreply.github.com>
 * All rights reserved.
 */

export default {
  chinese: {
    children: [
      '巴那帝巴大 唯臘媽尼 昔卡巴當 三媽地呀密',
      '阿地那他那 唯臘媽尼 昔卡巴當 三媽地呀密',
      '葛美舒 米恰遮拉 唯臘媽尼 昔卡巴當 三媽地呀密',
      '木沙哇他 唯臘媽尼 昔卡巴當 三媽地呀密',
      '穌拉美拉呀 媽車巴媽達它那 唯臘媽尼 昔卡巴當 三媽地呀密',
    ].join(' · '),
    title: '五戒',
  },
  pali: {
    sinhala: {
      children: [
        'පාණාතිපාතා වේරමණී සික්ඛාපදං සමාදියාමි',
        'අදින්නාදානා වේරමණී සික්ඛාපදං සමාදියාමි',
        'කාමේසු මිච්ඡාචාරා වේරමණී සික්ඛාපදං සමාදියාමි',
        'මුසාවාදා වේරමණී සික්ඛාපදං සමාදියාමි',
        'සුරාමේරය මජ්ජපමාදට්ඨානා වේරමණී සික්ඛාපදං සමාදියාමි',
      ].join(' . '),
      title: 'පන්සිල්',
    },
    title: 'Pañcasīla',
  },
  sanskrit: {
    children: [
      'पाणातिपाता वेरमणी सिख्खापदं समादियामि',
      'अदिन्नादाना वेरमणी सिख्खापदं समादियामि',
      'कामेसु मिच्छाचार वेरमणी सिख्खापदं समादियामि',
      'मुसावादा वेरमणी सिख्खापदं समादियामि',
      'सुरामेरय मज्जपमादट्ठाना वेरमणी सिख्खापदं समादियामि',
    ].join(' । '),
    siddham: {
      title: '𑖢𑖗𑖿𑖓𑖫𑖱𑖩',
    },
    title: 'पञ्चशील',
    transliteration: [
      'prāṇātipātā viratiḥ śikṣāpada samādiyāmi',
      'adattādānā viratiḥ śikṣāpada samādiyāmi',
      'kāmamithyācārā viratiḥ śikṣāpada samādiyāmi',
      'mṛṣāvādā viratiḥ śikṣāpada samādiyāmi',
      'surāmaireya mādyapramādasthānā viratiḥ śikṣāpada samādiyāmi',
    ].join(' । '),
  },
  tibetan: {
    title: 'བསླབ་པ་ལྔ',
  },
  translation: {
    title: 'Five Precepts',
  },
  transliteration: {
    children: [
      'pāṇātipātā veramaṇī sikkhāpadaṃ samādiyāmi',
      'adinnādānā veramaṇī sikkhāpadaṃ samādiyāmi',
      'kāmesumicchācāra veramaṇī sikkhāpadaṃ samādiyāmi',
      'musāvādā veramaṇī sikkhāpadaṃ samādiyāmi',
      'surāmeraya majjapamādaṭṭhānā veramaṇī sikkhāpadaṃ samādiyāmi',
    ].join(' । '),
    repetition: 1,
    speech: [
      'panatipata we-ramani sikhapadam samadiyami',
      'adinadana we-ramani sikhapadam samadiyami',
      'kame-sumichacara we-ramani sikhapadam samadiyami',
      'musawada we-ramani sikhapadam samadiyami',
      'surame-raya majapamadathana we-ramani sikhapadam samadiyami',
    ].join(', '),
    title: 'Pañcaśīla',
  },
};
