/*!
 * All the code that follow is
 * Copyright (c) 2015 - 2024 Richard Huang <rickypc@users.noreply.github.com>.
 * All Rights Reserved. Not for reuse without permission.
 */

export default {
  pali: {
    children: 'ye dhammā hetuppabhavā hetuṁ tesaṁ tathāgato uvāca । tesañ-ca yo nirodho evaṁvādī mahāsamaṇo । aññāṇaṁ cīyate kammaṁ jananaṁ kammakāraṇaṁ । ñāṇaṁ na cīyate kammaṁ kammābhāvaṁ na jāyate',
    sinhala: {
      children: 'යේ ධර්මා හේතුප්‍රභවා හේතුං තේෂාං තථාගත උවාච । තේෂාංච යෝ නිරෝධ ඒවංවාදී මහාශ්‍රමණඃ । අඥානාච්චීයතේ කර්ම ජන්මනඃ කර්ම කාරණම් । ඥානාන්නචීයතේ කර්ම කර්මාභාවාන්න ජායතේ',
      title: 'පටිච්චසමුප්පාද ගාථා',
    },
    title: 'Paṭiccasamuppāda Gāthā',
  },
  path: new URL('', import.meta.url).pathname,
  sanskrit: {
    children: 'ये धर्मा हेतुप्रभवा हेतुं तेषां तथागत उवाच । तेषांच यो निरोध एवंवादी महाश्रमणः । अज्ञानाच्चीयते कर्म जन्मनः कर्म कारणम् । ज्ञानान्नचीयते कर्म कर्माभावान्न जायते',
    siddham: {
      children: '𑖧𑖸 𑖠𑖨𑖿𑖦𑖯 𑖮𑖸𑖝𑖲𑖢𑖿𑖨𑖥𑖪𑖯 𑖮𑖸𑖝𑖲𑖽 𑖝𑖸𑖬𑖯𑖽 𑖝𑖞𑖯𑖐𑖝 𑖄𑖪𑖯𑖓 𑗂 𑖝𑖸𑖬𑖯𑖽𑖓 𑖧𑖺 𑖡𑖰𑖨𑖺𑖠 𑖊𑖪𑖽𑖪𑖯𑖟𑖱 𑖦𑖮𑖯𑖫𑖿𑖨𑖦𑖜𑖾 𑗂 𑖀𑖕𑖿𑖗𑖯𑖡𑖯𑖓𑖿𑖓𑖱𑖧𑖝𑖸 𑖎𑖨𑖿𑖦 𑖕𑖡𑖿𑖦𑖡𑖾 𑖎𑖨𑖿𑖦 𑖎𑖯𑖨𑖜𑖦𑖿 𑗂 𑖕𑖿𑖗𑖯𑖡𑖯𑖡𑖿𑖡𑖓𑖱𑖧𑖝𑖸 𑖎𑖨𑖿𑖦 𑖎𑖨𑖿𑖦𑖯𑖥𑖯𑖪𑖯𑖡𑖿𑖡 𑖕𑖯𑖧𑖝𑖸',
      title: '𑖢𑖿𑖨𑖝𑖱𑖝𑖿𑖧𑖭𑖦𑖲𑖝𑖿𑖢𑖯𑖟 𑖐𑖯𑖞𑖯',
    },
    title: 'प्रतीत्यसमुत्पाद गाथा',
  },
  tibetan: {
    children: 'ཡེ་དྷ་རྨཱ་ཧེ་ཏུ་པྲ་བྷ་བཱ་ཧེ་ཏུཾ་ཏེ་ཥཱཾ་ཏ་ཐཱ་ག་ཏ་ཨུ་བཱ་ཙ། ཏེ་ཥཱཾ་ཙ་ཡོ་ནི་རོ་དྷ་ཨེ་བཾ་བཱ་དཱི་མ་ཧཱ་ཤྲ་མ་ཎཿ',
    repeat: {
      roll: 46,
      wheel: 44,
    },
    title: 'རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་ཚིགས་སུ་བཅད་པ།',
  },
  translation: {
    title: 'Dependent Origination',
  },
  transliteration: {
    children: 'ye dharmā hetuprabhavā hetuṃ teṣāṃ tathāgata uvāca । teṣāṃ-ca yo nirodha evaṃvādi mahāśramaṇaḥ । ajñānāc cīyate karma janmanaḥ karma kāraṇam । jñānān na cīyate karma karmābhāvān na jāyate',
    repetition: 7,
    speech: 'y dharma hei-tu-prabawa, hei-tum t-samm tathagata uwaca, t-samm-ca yo nirodha, ewamwadi mahasramanah, ajnanac ciya-t karma, jan-manah karma karanam, jnanan na ciya-t karma, karmabawan na jayate',
    title: 'Pratītyasamutpāda Gāthā',
  },
};
