/*!
 * All the code that follow is
 * Copyright (c) 2015 - 2024 Richard Huang <rickypc@users.noreply.github.com>.
 * All Rights Reserved. Not for reuse without permission.
 */

export default {
  path: new URL('', import.meta.url).pathname,
  sanskrit: {
    children: 'नमो नव नवतीनां तथागत । गङ्गा नदी वालुका । कोटिनयुत शत सहस्रनाम् । ॐ भूभूरि । चारिनि चरि । चरण चिरे । मुनि मुनि । श्रेष्ठ अलंकारे स्वाहा',
    siddham: {
      children: '𑖡𑖦𑖺 𑖡𑖪 𑖡𑖪𑖝𑖱𑖡𑖯𑖽 𑖝𑖞𑖯𑖐𑖝 𑗂 𑖐𑖒𑖿𑖐𑖯 𑖡𑖟𑖱 𑖪𑖯𑖩𑖲𑖎𑖯 𑗂 𑖎𑖺𑖘𑖰𑖡𑖧𑖲𑖝 𑖫𑖝 𑖭𑖮𑖭𑖿𑖨𑖡𑖯𑖦𑖿 𑗂 𑖌𑖼 𑖥𑖳𑖥𑖳𑖨𑖰 𑗂 𑖓𑖯𑖨𑖰𑖡𑖰 𑖓𑖨𑖰 𑗂 𑖓𑖨𑖜 𑖓𑖰𑖨𑖸 𑗂 𑖦𑖲𑖡𑖰 𑖦𑖲𑖡𑖰 𑗂 𑖫𑖿𑖨𑖸𑖬𑖿𑖙 𑖀𑖩𑖽𑖎𑖯𑖨𑖸 𑖭𑖿𑖪𑖯𑖮𑖯',
      title: '𑖨𑖫𑖿𑖦𑖰𑖪𑖰𑖦𑖩𑖪𑖰𑖫𑖲𑖟𑖿𑖠𑖢𑖿𑖨𑖥𑖯 𑖡𑖯𑖦 𑖮𑖴𑖟𑖧',
    },
    title: 'रश्मिविमलविशुद्धप्रभा नाम हृदय',
  },
  tibetan: {
    children: 'ན་མོ་ན་བ་ན་བ་ཏཱི་ནཱཾ་ཏ་ཐཱ་ག་ཏ། ག་ངྒཱ་ན་དཱི་བཱ་ལུ་ཀཱ། ཀོ་ཊི་ན་ཡུ་ཏ་ཤ་ཏ་ས་ཧ་སྲ་ནཱ་མ། ༀ་བྷཱུ་བྷཱུ་རི། ཙཱ་རི་ནི་ཙ་རི། ཙ་ར་ཎ་ཙི་རེ། མུ་ནི་མུ་ནི། ཤྲེ་ཥྛ་ཨ་ལཾ་ཀཱ་རེ་སྭཱ་ཧཱ',
    repeat: {
      roll: 27,
      wheel: 26,
    },
    title: 'འོད་ཟེར་དྲི་མེད་སྙིང་པོ',
  },
  transliteration: {
    children: 'namo nava navatīnāṃ tathāgata । gaṅgā nadī vālukā । koṭinayuta śata sahasrānām । oṃ bhūbhūri । cārini cari । caraṇa cire । muni muni । śreṣṭha alaṃkāre svāhā',
    speech: 'namo nawa nawatinam tathagata, ganga nadi waluka, kotinayuta sata sahasranam, oum buburi, carini cari, carana cire, muni muni, srestha alamkare swaha',
    // Immaculate Radiance Hṛdaya.
    title: 'Raśmi Vimala Viśuddha Prabhā Nāma Hṛdaya',
  },
};
