/*!
 * All the code that follow is
 * Copyright (c) 2015 - 2025 Richard Huang <rickypc@users.noreply.github.com>.
 * All Rights Reserved. Not for reuse without permission.
 */

export default {
  chinese: {
    title: '無垢淨光大陀羅尼經',
  },
  path: import.meta.url,
  sanskrit: {
    children: 'नमो सप्त सप्ततिभ्यः । सम्यक्संबुद्ध कोटिनां परिशुद्ध मनस । वाचित्त प्रतिष्टितानां । नमो भगवते अमितायुशस्य तथागतस्य । ॐ तथागत शुद्धे आयुविशुद्धनि । संहार संहार । सर्वतथागता वीर्य वलेद प्रति संहार । आयु स्मर स्मर । सर्वतथागता समयम् । बोधि बोधि । बुद्ध्या विबुद्ध्या । बोधय बोधय । सर्व सत्वनां । सर्व पापं वरण विशुद्धे । विगतमार भयं । सुबुद्धा बुद्धे हुरु हुरु स्वाहा',
    siddham: {
      children: '𑖡𑖦𑖺 𑖭𑖢𑖿𑖝 𑖭𑖢𑖿𑖝𑖝𑖰𑖥𑖿𑖧𑖾 𑗂 𑖭𑖦𑖿𑖧𑖎𑖿𑖭𑖽𑖤𑖲𑖟𑖿𑖠 𑖎𑖺𑖘𑖰𑖡𑖯𑖽 𑖢𑖨𑖰𑖫𑖲𑖟𑖿𑖠 𑖦𑖡𑖭 𑗂 𑖪𑖯𑖓𑖰𑖝𑖿𑖝 𑖢𑖿𑖨𑖝𑖰𑖬𑖿𑖘𑖰𑖝𑖯𑖡𑖯𑖽 𑗂 𑖡𑖦𑖺 𑖥𑖐𑖪𑖝𑖸 𑖀𑖦𑖰𑖝𑖯𑖧𑖲𑖫𑖭𑖿𑖧 𑖝𑖞𑖯𑖐𑖝𑖭𑖿𑖧 𑗂 𑖌𑖼 𑖝𑖞𑖯𑖐𑖝 𑖫𑖲𑖟𑖿𑖠𑖸 𑖁𑖧𑖲𑖪𑖰𑖫𑖲𑖟𑖿𑖠𑖡𑖰 𑗂 𑖭𑖽𑖮𑖯𑖨 𑖭𑖽𑖮𑖯𑖨 𑗂 𑖭𑖨𑖿𑖪𑖝𑖞𑖯𑖐𑖝𑖯 𑖪𑖱𑖨𑖿𑖧 𑖪𑖩𑖸𑖟 𑖢𑖿𑖨𑖝𑖰 𑖭𑖽𑖮𑖯𑖨 𑗂 𑖁𑖧𑖲 𑖭𑖿𑖦𑖨 𑖭𑖿𑖦𑖨 𑗂 𑖭𑖨𑖿𑖪𑖝𑖞𑖯𑖐𑖝𑖯 𑖭𑖦𑖧𑖦𑖿 𑗂 𑖤𑖺𑖠𑖰 𑖤𑖺𑖠𑖰 𑗂 𑖤𑖲𑖟𑖿𑖠𑖿𑖧𑖯 𑖪𑖰𑖤𑖲𑖟𑖿𑖠𑖿𑖧𑖯 𑗂 𑖤𑖺𑖠𑖧 𑖤𑖺𑖠𑖧 𑗂 𑖭𑖨𑖿𑖪 𑖭𑖝𑖿𑖪𑖡𑖯𑖽 𑗂 𑖭𑖨𑖿𑖪 𑖢𑖯𑖢𑖽 𑖪𑖨𑖜 𑖪𑖰𑖫𑖲𑖟𑖿𑖠𑖸 𑗂 𑖪𑖰𑖐𑖝𑖦𑖯𑖨 𑖥𑖧𑖽 𑗂 𑖭𑖲𑖤𑖲𑖟𑖿𑖠𑖯 𑖤𑖲𑖟𑖿𑖠𑖸 𑖮𑖲𑖨𑖲 𑖮𑖲𑖨𑖲 𑖭𑖿𑖪𑖯𑖮𑖯',
      title: '𑖨𑖫𑖿𑖦𑖰𑖪𑖰𑖦𑖩𑖪𑖰𑖫𑖲𑖟𑖿𑖠𑖢𑖿𑖨𑖥𑖯 𑖡𑖯𑖦 𑖠𑖯𑖨𑖜𑖱',
    },
    title: 'रश्मिविमलविशुद्धप्रभा नाम धारणी',
  },
  tibetan: {
    children: 'ན་མོ་ས་པྟ་ས་པྟ་ཏི་བྷྱཿ། ས་མྱ་ཀྶཾ་བུ་དྡྷ་ཀོ་ཊི་ནཱཾ་པ་རི་ཤུ་དྡྷ་མ་ན་ས། བཱ་ཙི་ཏྟ་པྲ་ཏི་ཥྚི་ཏཱ་ནཱཾ། ན་མོ་བྷ་ག་བ་ཏེ་ཨ་མི་ཏཱ་ཡུ་ཤ་སྱ་ཏ་ཐཱ་ག་ཏ་སྱ། ༀ་ཏ་ཐཱ་ག་ཏ་ཤུ་དྡྷེ་ཨཱ་ཡུ་བི་ཤུ་དྡྷ་ནི། སཾ་ཧཱ་ར་སཾ་ཧཱ་ར། སརྦ་ཏ་ཐཱ་ག་ཏཱ་བཱི་རི་ཡ་བ་ལེ་ད་པྲ་ཏི་སཾ་ཧཱ་ར། ཨཱ་ཡུ་སྨ་ར་སྨ་ར། སརྦ་ཏ་ཐཱ་ག་ཏཱ་ས་མ་ཡ་མ། བོ་དྷི་བོ་དྷི། བུ་དྷ་ཡ་བི་བུ་དྷ་ཡ། བོ་དྷ་ཡ་བོ་དྷ་ཡ། སརྦ་ས་ཏྭ་ནཱཾ། སརྦ་པཱ་པཾ་བ་ར་ཎ་བི་ཤུ་དྡྷེ། བི་ག་ཏ་མཱ་ར་བྷ་ཡཾ། སུ་བུ་དྡྷཱ་བུ་དྡྷེ་ཧུ་རུ་ཧུ་རུ་སྭཱ་ཧཱ',
    repeat: {
      roll: 10,
      wheel: 10,
    },
    title: 'འཕགས་པ་འོད་ཟེར་དྲི་མ་མེད་པ་རྣམ་པར་དག་པའི་འོད་ཅེས་བྱ་བའི་གཟུངས',
  },
  transliteration: {
    children: 'namo sapta saptatibhyaḥ । samyaksaṃbuddha koṭināṃ pariśuddha manasa । vācitta pratiṣṭitānāṃ । namo bhagavate amitāyuṣasya tathāgatasya । oṃ tathāgata śuddhe āyuviśuddhani । saṃhāra saṃhāra । sarva tathāgata vīrya valeda prati saṃhāra । āyu smara smara । sarva tathāgata samayaṃ । bodhi bodhi । buddhyā vibuddhyā । bodhaya bodhaya । sarva satvanāṃ । sarva pāpā varaṇa viśuddhe । vigatamāra bhayaṃ । subuddhā buddhe huru huru svāhā',
    speech: 'namo sapta saptatibyah, samyaksambuddha kotinam parisuddha manasa, wacitta pratistitanam, namo bagawate amitayusasya tathagatasya, oum tathagata suddhe ayuwisuddhani, samhara samhara, sarwa tathagata, wirya wa-le-da prati samhara, ayu smara smara, sarwa tathagata samayam, bodhi bodhi, buddhya wibuddhya, bodhaya bodhaya, sarwa satwanam, sarwa papa warana wisuddhe, wigatamara bayam, subuddha buddhe huru huru swaha',
    // Immaculate Radiance Dhāraṇī.
    title: 'Raśmi Vimala Viśuddha Prabhā Nāma Dhāraṇī',
  },
};
