/*!
 * Copyright © 2015 Richard Huang <rickypc@users.noreply.github.com>
 * All rights reserved.
 */

export default {
  chinese: {
    children: '嗡 種 梭哈 · 嗡 阿彌達阿育達迭 梭哈 · 嗡 阿彌達 爹嘉瓦低 梭哈',
    title: '佛頂尊勝佛母',
  },
  path: import.meta.url,
  sanskrit: {
    children: 'ॐ भ्रूं स्वाहा । ॐ अमृत आयुर्ददे स्वाहा । ॐ अमृत तेजवति स्वाहा',
    siddham: {
      children: '𑖌𑖼 𑖥𑖿𑖨𑖳𑖽 𑖭𑖿𑖪𑖯𑖮𑖯 𑗂 𑖌𑖼 𑖀𑖦𑖴𑖝 𑖁𑖧𑖲𑖨𑖿𑖟𑖟𑖸 𑖭𑖿𑖪𑖯𑖮𑖯 𑗂 𑖌𑖼 𑖀𑖦𑖴𑖝 𑖝𑖸𑖕𑖪𑖝𑖰 𑖭𑖿𑖪𑖯𑖮𑖯',
      title: '𑖄𑖬𑖿𑖜𑖱𑖬𑖪𑖰𑖕𑖧𑖯',
    },
    title: 'उष्णीषविजया',
  },
  tibetan: {
    children: 'ཨོཾ་བྷྲཱུཾ་སྭཱ་ཧཱ། ༀ་ཨ་མྲྀ་ཏ་ཨཱ་ཡུ་རྡ་དེ་སྭཱ་ཧཱ། ༀ་ཨ་མྲྀ་ཏ་ཏེ་ཛ་བ་ཏི་སྭཱ་ཧཱ',
    repeat: {
      condensed: 180,
      roll: 64,
      wheel: 62,
    },
    title: 'གཙུག་ཏོར་རྣམ་རྒྱལ་མ',
  },
  translation: {
    title: 'Victorious Crown',
  },
  transliteration: {
    children: 'oṃ bhrūṃ svāhā । oṃ amṛta āyurdade svāhā । oṃ amṛta tejavati svāhā',
    speech: 'oum bhrum swaha, oum amrita ayurdade swaha, oum amrita t-jawati swaha',
    title: 'Uṣṇīṣavijayā Hṛdaya',
  },
};
