/*!
 * All the code that follow is
 * Copyright (c) 2015 - 2024 Richard Huang <rickypc@users.noreply.github.com>.
 * All Rights Reserved. Not for reuse without permission.
 */

export default {
  path: new URL('', import.meta.url).pathname,
  sanskrit: {
    children: 'ॐ नमस्त्र्यध्विकानां । सर्वतथागता हृदय गर्भे । ज्वल ज्वल । धर्मधातु गर्भे । सांभारा मम आयु संशोधय मम सर्व पापं । सर्व तथागत समन्त उष्णीष विमले विशुद्धे । हूँ हूँ हूँ हूँ । अं वं सं जः स्वाहा',
    siddham: {
      children: '𑖌𑖼 𑖡𑖦𑖭𑖿𑖝𑖿𑖨𑖿𑖧𑖠𑖿𑖪𑖰𑖎𑖯𑖡𑖯𑖽 𑗂 𑖭𑖨𑖿𑖪𑖝𑖞𑖯𑖐𑖝𑖯 𑖮𑖴𑖟𑖧 𑖐𑖨𑖿𑖥𑖸 𑗂 𑖕𑖿𑖪𑖩 𑖕𑖿𑖪𑖩 𑗂 𑖠𑖨𑖿𑖦𑖠𑖯𑖝𑖲 𑖐𑖨𑖿𑖥𑖸 𑗂 𑖭𑖯𑖽𑖥𑖯𑖨𑖯 𑖦𑖦 𑖁𑖧𑖲 𑖭𑖽𑖫𑖺𑖠𑖧 𑖦𑖦 𑖭𑖨𑖿𑖪 𑖢𑖯𑖢𑖽 𑗂 𑖭𑖨𑖿𑖪 𑖝𑖞𑖯𑖐𑖝 𑖭𑖦𑖡𑖿𑖝 𑖄𑖬𑖿𑖜𑖱𑖬 𑖪𑖰𑖦𑖩𑖸 𑖪𑖰𑖫𑖲𑖟𑖿𑖠𑖸 𑗂 𑖮𑖳𑖼 𑖮𑖳𑖼 𑖮𑖳𑖼 𑖮𑖳𑖼 𑗂 𑖀𑖽 𑖪𑖽 𑖭𑖽 𑖕𑖾 𑖭𑖿𑖪𑖯𑖮𑖯',
      title: '𑖪𑖰𑖦𑖩 𑖄𑖬𑖿𑖜𑖱𑖬',
    },
    title: 'विमल उष्णीष',
  },
  tibetan: {
    children: 'ༀ་ན་མ་སྟྲྱ་དྷྭི་ཀཱ་ནཱཾ། སརྦ་ཏ་ཐཱ་ག་ཏཱ་ཧྲྀ་ད་ཡ་ག་རྦྷེ། ཛྭ་ལ་ཛྭ་ལ། དྷ་རྨ་དྷཱ་ཏུ་ག་རྦྷེ། སཱཾ་བྷཱ་རཱ་མ་མ་ཨཱ་ཡུ་སཾ་ཤོ་དྷ་ཡ་མ་མ་སརྦ་པཱ་པཾ། སརྦ་ཏ་ཐཱ་ག་ཏ་ས་མ་ནྟ་ཨུ་ཥྞཱི་ཥ་བི་མ་ལེ་བི་ཤུ་དྡྷེ། ཧཱུྃ་ཧཱུྃ་ཧཱུྃ་ཧཱུྃ། ཨཾ་བཾ་སཾ་ཛཿསྭཱ་ཧཱ',
    repeat: {
      roll: 21,
      wheel: 21,
    },
    title: 'གཙུག་ཏོར་དྲི་མེད',
  },
  translation: {
    title: 'Great Wisdom - Stainless Uṣṇīṣa',
  },
  transliteration: {
    children: 'oṃ namastryadhvikānāṃ । sarva tathāgata hṛdaya garbhe । jvāla jvāla । dharmadhātu garbhe । saṁbhara mama āyuḥ saṃśodhaya mama sarva pāpaṁ । sarva tathāgata samanta uṣṇīṣa vimale viśuddhe । hūṁ hūṁ hūṁ hūṁ । aṁ vaṁ saṁ jaḥ svāhā',
    repetition: 21,
    speech: 'oum namas-tryadhwikanam, sarwa tathagata hridaya garbe, jwala jwala, dharmadhatu garbe, sambara mama ayuh samsodhaya, mama sarwa papam, sarwa tathagata, samanta usnisa, wimale wisuddhe, houm houm houm houm, ammm, wamm, samm, jah, swaha',
    title: 'Vimala Uṣṇīṣa',
  },
};
