/*!
 * Copyright © 2015 Richard Huang <rickypc@users.noreply.github.com>
 * All rights reserved.
 */

export default {
  chinese: {
    childrenx: [
      '巴那帝巴大 唯臘媽尼 昔卡巴當 三媽地呀密',
      '阿地那他那 唯臘媽尼 昔卡巴當 三媽地呀密',
      '葛美舒 米恰遮拉 唯臘媽尼 昔卡巴當 三媽地呀密',
      '木沙哇他 唯臘媽尼 昔卡巴當 三媽地呀密',
      '穌拉美拉呀 媽車巴媽達它那 唯臘媽尼 昔卡巴當 三媽地呀密',
    ].join(' · '),
    title: '五戒',
    transliteration: [
      '我受持不殺生學處',
      '我受持不偷盜學處',
      '我受持不邪淫學處',
      '我受持不妄語學處',
      '我受持不飲酒學處',
    ].join(' · '),
  },
  pali: {
    sinhala: {
      children: [
        'පාණාතිපාතා වෙරමණී සික්ඛාපදං සමාදියාමි',
        'අදින්නාදානා වෙරමණී සික්ඛාපදං සමාදියාමි',
        'කාමෙසුමිච්ඡාචාරා වෙරමණී සික්ඛාපදං සමාදියාමි',
        'මුසාවාදා වෙරමණී සික්ඛාපදං සමාදියාමි',
        'සුරාමෙරය මද්ජපමාදට්ඨානාවෙරමණී සික්ඛාපදං සමාදියාමි',
      ].join(' . '),
      title: 'පන්සිල්',
    },
    title: 'Pañcasīla',
  },
  path: import.meta.url,
  sanskrit: {
    children: [
      'प्राणातिपातात् विरतिः शिक्षापदं समादियामि',
      'अदत्तादानात् विरतिः शिक्षापदं समादियामि',
      'काममिथ्याचारात् विरतिः शिक्षापदं समादियामि',
      'मृषावादात् विरतिः शिक्षापदं समादियामि',
      'सुरा–मैरेय–मद्यप्रमादस्थानात् विरतिः शिक्षापदं समादियामि',
    ].join(' । '),
    siddham: {
      children: [
        '𑖢𑖯𑖠𑖯𑖡𑖿𑖠𑖳𑖝𑖯𑖩𑖿𑖠 𑖯𑖬𑖪𑖿𑖪𑖦𑖰𑖡𑖰 𑖭𑖰𑖢𑖿𑖝𑖩𑖰𑖡𑖿 𑖭𑖩𑖳𑖟𑖰𑖬𑖩𑖰𑖹𑖦𑖰',
        '𑖀𑖠𑖰𑖡𑖿𑖡𑖯𑖠𑖰𑖡𑖿 𑖯𑖬𑖪𑖿𑖪𑖦𑖰𑖡𑖰 𑖭𑖰𑖢𑖿𑖝𑖩𑖰𑖡𑖿 𑖭𑖩𑖳𑖟𑖰𑖬𑖩𑖰𑖹𑖦𑖰',
        '𑖎𑖹𑖦𑖹𑖭𑖰𑖡𑖿𑖡𑖯𑖠𑖳𑖪𑖰 𑖯𑖬𑖪𑖿𑖪𑖦𑖰𑖡𑖰 𑖭𑖰𑖢𑖿𑖝𑖩𑖰𑖡𑖿 𑖭𑖩𑖳𑖟𑖰𑖬𑖩𑖰𑖹𑖦𑖰',
        '𑖦𑖳𑖭𑖯𑖡𑖿𑖡𑖯𑖠𑖰 𑖯𑖬𑖪𑖿𑖪𑖦𑖰𑖡𑖰 𑖭𑖰𑖢𑖿𑖝𑖩𑖰𑖡𑖿 𑖭𑖩𑖳𑖟𑖰𑖬𑖩𑖰𑖹𑖦𑖰',
        '𑖭𑖳𑖫𑖯𑖭𑖳𑖪𑖰𑖡𑖿𑖡 𑖦𑖰𑖘𑖿𑖘𑖳𑖠𑖰𑖡𑖿𑖡 𑖯𑖬𑖪𑖿𑖪𑖦𑖰𑖡𑖰 𑖭𑖰𑖢𑖿𑖝𑖩𑖰𑖡𑖿 𑖭𑖩𑖳𑖟𑖰𑖬𑖩𑖰𑖹𑖦𑖰',
      ].join(' । '),
      title: '𑖢𑖰𑖡𑖿𑖕𑖰𑖭𑖿𑖭𑖰𑖩',
    },
    title: 'पञ्चशील',
    transliteration: [
      'prāṇātipātāt viratiḥ śikṣāpadaṃ samādiyāmi',
      'adattādānāt viratiḥ śikṣāpadaṃ samādiyāmi',
      'kāmamithyācārāt viratiḥ śikṣāpadaṃ samādiyāmi',
      'mṛṣāvādāt viratiḥ śikṣāpadaṃ samādiyāmi',
      'surā maireya madyapramādasthānāt viratiḥ śikṣāpadaṃ samādiyāmi',
    ].join(' । '),
  },
  tibetan: {
    title: 'བསླབ་པ་ལྔ',
  },
  translation: {
    title: 'Five Precepts',
  },
  transliteration: {
    children: [
      'pāṇātipātā veramaṇī sikkhāpadaṃ samādiyāmi',
      'adinnādānā veramaṇī sikkhāpadaṃ samādiyāmi',
      'kāmesumicchācāra veramaṇī sikkhāpadaṃ samādiyāmi',
      'musāvādā veramaṇī sikkhāpadaṃ samādiyāmi',
      'surāmeraya majjapamādaṭṭhānā veramaṇī sikkhāpadaṃ samādiyāmi',
    ].join(' । '),
    repetition: 1,
    title: 'Pañcaśīla',
  },
};
