/*!
 * Copyright © 2015 Richard Huang <rickypc@users.noreply.github.com>
 * All rights reserved.
 */

export default {
  chinese: {
    title: '一切如來心秘密全身舍利寶篋印陀羅尼經',
  },
  path: import.meta.url,
  sanskrit: {
    children: 'नमस्त्र्यध्विकानां सर्वतथागतानां । ॐ भुविभवनवरे वचनवचति । सुरु सुरु धर धर । सर्व तथागतधातु धरे पद्मं भवति । जयवरे मुद्रे । स्मर तथागत धर्मचक्र प्रवर्तन वज्रे बोधि मण्डालङ् कारालङ् कृते । सर्व तथागताधिष्ठिते । बोधय बोधय बोधि बोधि बुध्य बुध्य । संबोधनि संबोधय । चल चल चलन्तु सर्वावरणानि । सर्व पापविगते । हुरु हुरु सर्व शोकविगते । सर्व तथागत हृदय वज्रिणि । संभार संभार । सर्व तथागत गुह्य धारणी मुद्रे । भूते सुभूते । सर्व तथागताधिष्ठितधातु गर्भे स्वाहा । समयाधिष्ठिते स्वाहा । सर्व तथागत हृदय धातु मुद्रे स्वाहा । सुप्रतिष्ठितस्तूपे तथागताधिष्ठिते हुरु हुरु हूं हूं स्वाहा । ॐ सर्व तथागतोष्णीष धातु मुद्राणि सर्व तथागत सधातु विभूषिताधिष्ठिते हूं हूं स्वाहा',
    siddham: {
      children: '𑖡𑖦𑖭𑖿𑖝𑖿𑖨𑖿𑖧𑖠𑖿𑖪𑖰𑖎𑖯𑖡𑖯𑖽 𑖭𑖨𑖿𑖪𑖝𑖞𑖯𑖐𑖝𑖯𑖡𑖯𑖽 𑗂 𑖌𑖼 𑖥𑖲𑖪𑖰𑖥𑖪𑖡𑖪𑖨𑖸 𑖪𑖓𑖡𑖪𑖓𑖝𑖰 𑗂 𑖭𑖲𑖨𑖲 𑖭𑖲𑖨𑖲 𑖠𑖨 𑖠𑖨 𑗂 𑖭𑖨𑖿𑖪 𑖝𑖞𑖯𑖐𑖝𑖠𑖯𑖝𑖲 𑖠𑖨𑖸 𑖢𑖟𑖿𑖦𑖽 𑖥𑖪𑖝𑖰 𑗂 𑖕𑖧𑖪𑖨𑖸 𑖦𑖲𑖟𑖿𑖨𑖸 𑗂 𑖭𑖿𑖦𑖨 𑖝𑖞𑖯𑖐𑖝 𑖠𑖨𑖿𑖦𑖓𑖎𑖿𑖨 𑖢𑖿𑖨𑖪𑖨𑖿𑖝𑖡 𑖪𑖕𑖿𑖨𑖸 𑖤𑖺𑖠𑖰 𑖦𑖜𑖿𑖚𑖯𑖩𑖒𑖿 𑖎𑖯𑖨𑖯𑖩𑖒𑖿 𑖎𑖴𑖝𑖸 𑗂 𑖭𑖨𑖿𑖪 𑖝𑖞𑖯𑖐𑖝𑖯𑖠𑖰𑖬𑖿𑖙𑖰𑖝𑖸 𑗂 𑖤𑖺𑖠𑖧 𑖤𑖺𑖠𑖧 𑖤𑖺𑖠𑖰 𑖤𑖺𑖠𑖰 𑖤𑖲𑖠𑖿𑖧 𑖤𑖲𑖠𑖿𑖧 𑗂 𑖭𑖽𑖤𑖺𑖠𑖡𑖰 𑖭𑖽𑖤𑖺𑖠𑖧 𑗂 𑖓𑖩 𑖓𑖩 𑖓𑖩𑖡𑖿𑖝𑖲 𑖭𑖨𑖿𑖪𑖯𑖪𑖨𑖜𑖯𑖡𑖰 𑗂 𑖭𑖨𑖿𑖪 𑖢𑖯𑖢𑖪𑖰𑖐𑖝𑖸 𑗂 𑖮𑖲𑖨𑖲 𑖮𑖲𑖨𑖲 𑖭𑖨𑖿𑖪 𑖫𑖺𑖎𑖪𑖰𑖐𑖝𑖸 𑗂 𑖭𑖨𑖿𑖪 𑖝𑖞𑖯𑖐𑖝 𑖮𑖴𑖟𑖧 𑖪𑖕𑖿𑖨𑖰𑖜𑖰 𑗂 𑖭𑖽𑖥𑖯𑖨 𑖭𑖽𑖥𑖯𑖨 𑗂 𑖭𑖨𑖿𑖪 𑖝𑖞𑖯𑖐𑖝 𑖐𑖲𑖮𑖿𑖧 𑖠𑖯𑖨𑖜𑖱 𑖦𑖲𑖟𑖿𑖨𑖸 𑗂 𑖥𑖳𑖝𑖸 𑖭𑖲𑖥𑖳𑖝𑖸 𑗂 𑖭𑖨𑖿𑖪 𑖝𑖞𑖯𑖐𑖝𑖯𑖠𑖰𑖬𑖿𑖙𑖰𑖝𑖠𑖯𑖝𑖲 𑖐𑖨𑖿𑖥𑖸 𑖭𑖿𑖪𑖯𑖮𑖯 𑗂 𑖭𑖦𑖧𑖯𑖠𑖰𑖬𑖿𑖙𑖰𑖝𑖸 𑖭𑖿𑖪𑖯𑖮𑖯 𑗂 𑖭𑖨𑖿𑖪 𑖝𑖞𑖯𑖐𑖝 𑖮𑖴𑖟𑖧 𑖠𑖯𑖝𑖲 𑖦𑖲𑖟𑖿𑖨𑖸 𑖭𑖿𑖪𑖯𑖮𑖯 𑗂 𑖭𑖲𑖢𑖿𑖨𑖝𑖰𑖬𑖿𑖙𑖰𑖝𑖭𑖿𑖝𑖳𑖢𑖸 𑖝𑖞𑖯𑖐𑖝𑖯𑖠𑖰𑖬𑖿𑖙𑖰𑖝𑖸 𑖮𑖲𑖨𑖲 𑖮𑖲𑖨𑖲 𑖮𑖳𑖽 𑖮𑖳𑖽 𑖭𑖿𑖪𑖯𑖮𑖯 𑗂 𑖌𑖼 𑖭𑖨𑖿𑖪 𑖝𑖞𑖯𑖐𑖝𑖺𑖬𑖿𑖜𑖱𑖬 𑖠𑖯𑖝𑖲 𑖦𑖲𑖟𑖿𑖨𑖯𑖜𑖰 𑖭𑖨𑖿𑖪 𑖝𑖞𑖯𑖐𑖝 𑖭𑖠𑖯𑖝𑖲 𑖪𑖰𑖥𑖳𑖬𑖰𑖝𑖯𑖠𑖰𑖬𑖿𑖙𑖰𑖝𑖸 𑖮𑖳𑖽 𑖮𑖳𑖽 𑖭𑖿𑖪𑖯𑖮𑖯',
      title: '𑖐𑖲𑖮𑖿𑖧𑖠𑖯𑖝𑖲𑖎𑖨𑖜𑖿𑖚',
    },
    title: 'गुह्यधातुकरण्ड',
  },
  tibetan: {
    children: 'ན་མ་སྟྲྱ་དྷྭི་ཀཱ་ནཱཾ་སརྦ་ཏ་ཐཱ་ག་ཏཱ་ནཱཾ། ༀ་བྷུ་བི་བྷ་བ་ན་བ་རེ་བ་ཙ་ན་བ་ཙ་ཏི། སུ་རུ་སུ་རུ་དྷ་ར་དྷ་ར། སརྦ་ཏ་ཐཱ་ག་ཏ་དྷཱ་ཏུ་དྷ་རེ་པ་དྨཾ་བྷ་བ་ཏི། ཛ་ཡ་བ་རེ་མུ་དྲེ། སྨ་ར་ཏ་ཐཱ་ག་ཏ་དྷ་རྨ་ཙ་ཀྲ་པྲ་བ་རྟ་ན་བ་ཛྲེ་བོ་དྷི་མ་ཎྜཱ་ལ་ང་ཀཱ་རཱ་ལ་ང་ཀྲྀ་ཏེ། སརྦ་ཏ་ཐཱ་ག་ཏཱ་དྷི་ཥྛི་ཏེ། བོ་དྷ་ཡ་བོ་དྷཡ་བོ་དྷི་བོ་དྷི་བུ་དྷྱ་བུ་དྷྱ། སཾ་བོ་དྷ་ནི་སཾ་བོ་དྷ་ཡ། ཙ་ལ་ཙ་ལ་ཙ་ལ་ནྟུ་ས་རྦཱ་བ་ར་ཎཱ་ནི། སརྦ་པཱ་པ་བི་ག་ཏེ། ཧུ་རུ་ཧུ་རུ་སརྦ་ཤོ་ཀ་བི་ག་ཏེ། སརྦ་ཏ་ཐཱ་ག་ཏ་ཧྲྀ་ད་ཡ་བ་ཛྲི་ཎི། སཾ་བྷཱ་ར་སཾ་བྷཱ་ར། སརྦ་ཏ་ཐཱ་ག་ཏ་གུ་ཧྱ་དྷཱ་ར་ཎཱི་མུ་དྲེ། བྷཱུ་ཏེ་སུ་བྷཱུ་ཏེ། སརྦ་ཏ་ཐཱ་ག་ཏཱ་དྷི་ཥྛི་ཏ་དྷཱ་ཏུ་ག་རྦྷེ་སྭཱ་ཧཱ། ས་མ་ཡཱ་དྷི་ཥྛི་ཏེ་སྭཱ་ཧཱ། སརྦ་ཏ་ཐཱ་ག་ཏ་ཧྲྀ་ད་ཡ་དྷཱ་ཏུ་མུ་དྲེ་སྭཱ་ཧཱ། སུ་པྲ་ཏི་ཥྛི་ཏ་སྟཱུ་པེ་ཏ་ཐཱ་ག་ཏཱ་དྷི་ཥྛི་ཏེ་ཧུ་རུ་ཧུ་རུ་ཧཱུཾ་ཧཱུཾ་སྭཱ་ཧཱ། ༀ་སརྦ་ཏ་ཐཱ་ག་ཏོ་ཥྞཱི་ཥ་དྷཱ་ཏུ་མུ་དྲཱ་ཎི་སརྦ་ཏ་ཐཱ་ག་ཏ་ས་དྷཱ་ཏུ་བི་བྷཱུ་ཥི་ཏཱ་དྷི་ཥྛི་ཏེ་ཧཱུཾ་ཧཱུཾ་སྭཱ་ཧཱ',
    repeat: { condensed: 17, roll: 6, wheel: 5 },
    title: 'གསང་བ་རིང་བསྲེལ',
  },
  transliteration: {
    children: 'namastryadhvikānāṃ sarvatathāgatānāṃ । oṃ bhuvibhavanavare vacanavacati । suru suru dhara dhara । sarva tathāgatadhātu dhare padmaṃ bhavati । jayavare mudre । smara tathāgata dharmacakra pravartana vajre bodhi maṇḍālaṅ kārālaṅ kṛte । sarva tathāgatādhiṣṭhite । bodhaya bodhaya bodhi bodhi budhya budhya । saṃbodhani saṃbodhaya । cala cala calantu sarvāvaraṇāni । sarva pāpavigate । huru huru sarva śokavigate । sarva tathāgata hṛdaya vajriṇi । saṃbhāra saṃbhāra । sarva tathāgata guhya dhāraṇī mudre । bhūte subhūte । sarva tathāgatādhiṣṭhitadhātu garbhe svāhā । samayādhiṣṭhite svāhā । sarva tathāgata hṛdaya dhātu mudre svāhā । supratiṣṭhitastūpe tathāgatādhiṣṭhite huru huru hūṃ hūṃ svāhā । oṃ sarva tathāgatoṣṇīṣa dhātu mudrāṇi sarva tathāgata sadhātu vibhūṣitādhiṣṭhite hūṃ hūṃ svāhā',
    // Secret Relics Casket.
    title: 'Guhyadhātukaraṇḍa',
  },
};
