/*!
 * Copyright © 2015 Richard Huang <rickypc@users.noreply.github.com>
 * All rights reserved.
 */

export default {
  lang: 'sa-IN',
  pali: {
    children: [
      'buddho mahāmaṇiratana paṭimākara pūjemi',
      'etena saccavajjena mahātejo ceva mahāpañño',
      'ca mahābhogo ca mahāyaso ca bhavantu me',
      'nibbānassa paccayo hotu',
    ].join(' । '),
    sinhala: {
      children: [
        'බුද්ධෝ මහාමණිරතන පටිමාකර පූජේමි',
        'ඒතේන සච්චවජ්ජේන මහාතේජෝ චේව මහාපඤ්ඤෝ',
        'ච මහාභෝගෝ ච මහායසෝ ච භවන්තු මේ',
        'නිබ්බානස්ස පච්චයෝ හෝතු',
      ].join(' . '),
      title: 'මහාමණිරතනපටිමාකර',
    },
    title: 'Mahāmaṇiratanapaṭimākara',
  },
  path: import.meta.url,
  sanskrit: {
    children: [
      'बुद्धो महामणिरत्नः प्रतिमाकारः पूजयामि',
      'एतेन सत्यवचनेन महातेजश्चैव महाप्रज्ञः',
      'च महाभोगश्च महायशश्च भवंतु मे',
      'निर्वाणस्य प्रत्ययः भवतु',
    ].join(' । '),
    siddham: {
      children: [
        '𑖤𑖳𑖟𑖿𑖠𑖺 𑖦𑖮𑖯𑖦𑖜𑖰𑖨𑖝𑖡 𑖢𑖘𑖰𑖦𑖯𑖎𑖨 𑖢𑖳𑖕𑖸𑖦𑖰',
        '𑖊𑖝𑖸𑖡 𑖯𑖓𑖿𑖓𑖳𑖕𑖿𑖕𑖸𑖡 𑖦𑖮𑖯𑖝𑖸𑖔𑖺 𑖓𑖸𑖪 𑖦𑖮𑖯𑖢𑖗𑖿𑖗𑖺',
        '𑖓 𑖦𑖮𑖯𑖥𑖺𑖐𑖺 𑖓 𑖦𑖮𑖯𑖧𑖫𑖺 𑖓 𑖥𑖪𑖡𑖿𑖝𑖲 𑖦𑖸',
        '𑖡𑖰𑖤𑖿𑖤𑖯𑖡𑖭𑖿𑖭𑖰𑖡𑖰𑖤𑖿𑖤𑖯𑖡𑖭𑖿𑖭 𑖢𑖓𑖧𑖺 𑖮𑖺𑖝𑖲',
      ].join(' 𑗂 '),
      title: '𑖦𑖮𑖯𑖦𑖜𑖰𑖨𑖝𑖡𑖢𑖘𑖰𑖦𑖯𑖎𑖨',
    },
    repeat: {
      condensed: 81,
      roll: 29,
      wheel: 28,
    },
    title: 'महामणिरत्नप्रतिमाकार',
    transliteration: [
      'buddho mahāmaṇiratna pratimākāra pūjayāmi',
      'etena satyavacanenā mahātejaś caiva mahāprajñaḥ',
      'ca mahābhogaḥ ca mahāyaśaḥ ca bhavantu me',
      'nirvāṇasya pratyayaḥ bhavatu',
    ].join(' । '),
    typography: {
      thangka: { default: 10, double: 20, single: 42.5 },
    },
  },
  thai: {
    children: [
      'พุทฺโธ มหา มณิรตน ปฏิมากร ปูเชมิ',
      'เอเตน สจฺจวชฺเชน มหาเตโช เจว มหาปญฺโญ',
      'จ มหาโภโค จ มหายโส จ ภวนฺตุ เม',
      'นิพฺพานสฺส ปจฺจโย โหตุ',
    ].join(' ฯ '),
    title: 'พระพุทธมหามหา มณีรตนปฏิมากร',
  },
  translation: {
    title: 'Great Emerald Buddha Essence (Heart)',
  },
  transliteration: {
    children: [
      'buddho mahāmaṇiratana paṭimākara pūjemi',
      'etena saccavajjena mahātejo ceva mahāpañño',
      'ca mahābhogo ca mahāyaso ca bhavantu me',
      'nibbānassa paccayo hotu',
    ].join(' । '),
    title: 'Mahāmaṇiratana Paṭimākara Hṛdaya',
  },
};
